// 入选理由
// 和二叉搜索树联动，大家可以提前预习一下。
// 链表的题目，我们核心思路就是链表的基本操作，别想别的。
// 比如链表上的快排，如果你不会快排，那么肯定做不出来，但不表示你不会链表，因此大家学习的时候一定要分清这些。
// 题目描述
// 给定一个单链表，其中的元素按升序排序，将其转换为高度平衡的二叉搜索树。
//
// 本题中，一个高度平衡二叉树是指一个二叉树每个节点 的左右两个子树的高度差的绝对值不超过 1。
//
// 示例:
//
//   给定的有序链表： [-10, -3, 0, 5, 9],
//
//   一个可能的答案是：[0, -3, 9, -10, null, 5], 它可以表示下面这个高度平衡二叉搜索树：
//
//       0
//       / \
//    -3   9
// /   /
// -10  5


var sortedListToBST = function (head) {

}

sortedListToBST({ val: 1, next: {val: 2, next: {val:3, next: {val: 4, next: null}}} })
